# Pandas Tutorial - 2

## Pandas Dataframes

### Dataframe object creation

In [2]:
import pandas as pd

In [3]:
D = {"State": ['AP', "HP", "UP", "KA"],
     "Size": [10,20,30,40],
     "Year": [2001,2002,2003,2004]
    }
X = pd.DataFrame(D)
X

  State  Size  Year
0    AP    10  2001
1    HP    20  2002
2    UP    30  2003
3    KA    40  2004

In [4]:
X = pd.DataFrame(D, columns=["State", "Size"])
X

  State  Size
0    AP    10
1    HP    20
2    UP    30
3    KA    40

In [5]:
X = pd.DataFrame(D, columns=["Year", "State", "Size"])
X

   Year State  Size
0  2001    AP    10
1  2002    HP    20
2  2003    UP    30
3  2004    KA    40

In [6]:
X = pd.DataFrame(D, columns=["Year", "State", "Size", "Population"])
X

   Year State  Size Population
0  2001    AP    10        NaN
1  2002    HP    20        NaN
2  2003    UP    30        NaN
3  2004    KA    40        NaN